УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОбособленнаяЗакупкаПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукцияВоВскрытойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РейтингПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Марка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоэффициентЕдиницыДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Качество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d7abca0-ac91-4ef9-a1ad-32697b4607d2">
    <name>смартНаименованиеСайт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="13dd1676-d9c6-415f-a4e1-cb9414a09577">
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="deac0f00-4a8f-4d18-a043-7799a7111d39">
    <name>КодВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="064e5a5a-2e2f-47ca-9f01-32f70a8b1c1e">
    <name>НаименованиеВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ДрагоценныеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДрагоценныйМатериал</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расположение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураПродаваемаяСовместно/НоменклатураПродаваемаяСовместно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3eb5ffef-8dc3-45c2-ace4-68651cb11634">
  <name>НоменклатураПродаваемаяСовместно</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="6f57b8df-9796-4249-bd20-b45e3d7c7100">
    <name>НоменклатураПредпосылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8e896ce7-7a99-49b9-ab7e-95f9844ebe98">
    <name>НоменклатураСледствие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Forms/смарт_ЗаполнениеСовместныхПродаж/Module.bsl
#Область СобытияФормыЭлементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборНоменклатура") Тогда
		ОтборНоменклатура = Параметры.ОтборНоменклатура;
	КонецЕсли;
	
	//++ смарт:ММ #103 495 18.04.2021 
	Если Параметры.Свойство("Режим") Тогда
		
		Режим = Параметры.Режим;
		
		Если Режим = 2 Тогда
			Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаПредпосылка.Заголовок = "Характеристика (следствие)";
			Элементы.НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствие.Заголовок = "Номенклатура (предпосылка)";
			Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствие.Заголовок = "Характеристика (предпосылка)";
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 18.04.2021
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьДоступностьКолонок();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВариантАнализаПриИзменении(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	НастроитьДоступностьКолонок();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	
	СоздатьЗаписиНаСервере();
	Оповестить("смартИзмененРегистрНоменклатураПродаваемаяСовместно");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		
		МенеджерЗаписи = РегистрыСведений.НоменклатураПродаваемаяСовместно.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВариантАнализа 				= ВариантАнализа;
		//++ смарт:ММ #103 495 18.04.2021 
		Если Режим = 1 Тогда
			МенеджерЗаписи.НоменклатураПредпосылка 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Строка.ХарактеристикаПредпосылка;			
			МенеджерЗаписи.НоменклатураСледствие 		= Строка.НоменклатураСледствие;
			МенеджерЗаписи.ХарактеристикаСледствие 		= Строка.ХарактеристикаСледствие;			
		Иначе
			МенеджерЗаписи.НоменклатураПредпосылка 		= Строка.НоменклатураСледствие;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Строка.ХарактеристикаСледствие;			
			МенеджерЗаписи.НоменклатураСледствие 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаСледствие 		= Строка.ХарактеристикаПредпосылка;			
		КонецЕсли;
		//-- смарт:ММ 18.04.2021
		МенеджерЗаписи.ДобавленоАвтоматически 		= Ложь;
		МенеджерЗаписи.ПроцентСлучаев 				= ПроцентСлучаев;
		МенеджерЗаписи.КоличествоСлучаев 			= КоличествоСлучаев;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	//++ смарт:ММ #103 495 04.05.2021 
	Если Не ЗначениеЗаполнено(ВариантАнализа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать вариант анализа");
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 04.05.2021
	
	МассивНедоступнойНоменклатуры = ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры();
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Истина, Истина, Истина);
	ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, ЭтаФорма.Элементы.НоменклатураПродаваемаяСовместноСДанной);
	
	Если МассивНедоступнойНоменклатуры.Количество() > 0 Тогда
		
		//Элемент = ФормаПодбора.СписокНоменклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент = ФормаПодбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		Элемент.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеВСписке;
		Элемент.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.Использование 		= Истина;
		Элемент.ПравоеЗначение 		= МассивНедоступнойНоменклатуры;
		
		Элемент.ИдентификаторПользовательскойНастройки = "ОтборСсылка";
		
	КонецЕсли;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		НоваяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
		НоваяСтрока.НоменклатураСледствие = ВыбранноеЗначение;
		НоваяСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого ВидРасчета Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
			НоваяСтрока.НоменклатураСледствие = ВидРасчета;
			НоваяСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекСтрока = Элемент.ТекущиеДанные; 
		ТекСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПослеУдаления(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	ПроставитьНомераСтрок();	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриАктивизацииСтроки(Элемент)
	
	НастроитьДоступностьКолонок();
		
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствиеПриИзменении(Элемент)
	
	НастроитьДоступностьКолонок();
	//ПроверитьСуществующуюНоменклатуруКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствиеПриИзменении(Элемент)
	//ПроверитьСуществующуюНоменклатуруКлиент();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыФункции

&НаКлиенте
Процедура НастроитьДоступностьКолонок()
	
	ПредпосылкаХарактеристикиИспользуются = ХарактеристикиИспользуются(ОтборНоменклатура); 
	Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаПредпосылка.ТолькоПросмотр = НЕ ПредпосылкаХарактеристикиИспользуются;

	ТекущиеДанные = Элементы.НоменклатураПродаваемаяСовместноСДанной.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СледствиеХарактеристикиИспользуются = ХарактеристикиИспользуются(ТекущиеДанные.НоменклатураСледствие);
		Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствие.ТолькоПросмотр = НЕ СледствиеХарактеристикиИспользуются;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХарактеристикиИспользуются(Номенклатура)
	
	Возврат Справочники.Номенклатура.ХарактеристикиИспользуются(Номенклатура);
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьКомандыСоздатьЗаписи()
	
	ДоступностьКнопки = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВариантАнализа) Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборНоменклатура) Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;

	Если НоменклатураПродаваемаяСовместноСДанной.Количество() = 0 Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;
	
	Если ДоступностьКнопки Тогда
		
		Запрос = Новый Запрос;
		//++ смарт:ММ #103 495 04.05.2021 
		Если Режим = 1 Тогда
		//-- смарт:ММ 04.05.2021
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураСледствие,
		|	НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие КАК ХарактеристикаСледствие
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НоменклатураПредпосылка КАК НоменклатураПредпосылка,
		|	ВТ_ТЧ.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	ВТ_ТЧ.НоменклатураСледствие КАК НоменклатураСледствие,
		|	ВТ_ТЧ.ХарактеристикаСледствие КАК ХарактеристикаСледствие,
		|	&ВариантАнализа КАК ВариантАнализа
		|ПОМЕСТИТЬ ВТ_ПроверяемыеЗаписи
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
		|	ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	ВТ_ПроверяемыеЗаписи.НоменклатураСледствие КАК НоменклатураСледствие,
		|	ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие КАК ХарактеристикаСледствие
		|ИЗ
		|	ВТ_ПроверяемыеЗаписи КАК ВТ_ПроверяемыеЗаписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|		ПО ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка = НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка
		|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка = НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка
		|			И ВТ_ПроверяемыеЗаписи.НоменклатураСледствие = НоменклатураПродаваемаяСовместно.НоменклатураСледствие
		|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие = НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие
		|			И ВТ_ПроверяемыеЗаписи.ВариантАнализа = НоменклатураПродаваемаяСовместно.ВариантАнализа";
		
		Запрос.УстановитьПараметр("НоменклатураПродаваемаяСовместно", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
		Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
		Запрос.УстановитьПараметр("НоменклатураПредпосылка", ОтборНоменклатура);
		
		//++ смарт:ММ #103 495 04.05.2021 
		ИначеЕсли Режим = 2 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка КАК ХарактеристикаСледствие,
			|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураПредпосылка,
			|	НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие КАК ХарактеристикаПредпосылка
			|ПОМЕСТИТЬ ВТ_ТЧ
			|ИЗ
			|	&НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&НоменклатураСледствие КАК НоменклатураСледствие,
			|	ВТ_ТЧ.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
			|	ВТ_ТЧ.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
			|	ВТ_ТЧ.ХарактеристикаСледствие КАК ХарактеристикаСледствие,
			|	&ВариантАнализа КАК ВариантАнализа
			|ПОМЕСТИТЬ ВТ_ПроверяемыеЗаписи
			|ИЗ
			|	ВТ_ТЧ КАК ВТ_ТЧ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
			|	ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
			|	ВТ_ПроверяемыеЗаписи.НоменклатураСледствие КАК НоменклатураСледствие,
			|	ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие КАК ХарактеристикаСледствие
			|ИЗ
			|	ВТ_ПроверяемыеЗаписи КАК ВТ_ПроверяемыеЗаписи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
			|		ПО ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка = НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка
			|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка = НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка
			|			И ВТ_ПроверяемыеЗаписи.НоменклатураСледствие = НоменклатураПродаваемаяСовместно.НоменклатураСледствие
			|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие = НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие
			|			И ВТ_ПроверяемыеЗаписи.ВариантАнализа = НоменклатураПродаваемаяСовместно.ВариантАнализа";
			
			Запрос.УстановитьПараметр("НоменклатураПродаваемаяСовместно", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
			Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
			Запрос.УстановитьПараметр("НоменклатураСледствие", ОтборНоменклатура);

		КонецЕсли;
		//-- смарт:ММ 04.05.2021
		РезультатЗапроса = Запрос.Выполнить();
		ДоступностьКнопки = РезультатЗапроса.Пустой();
		
	КонецЕсли;
	
	Элементы.ФормаСоздатьЗаписи.Доступность = ДоступностьКнопки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьСуществующуюНоменклатуруКлиент()
	
	//ТекущиеДанные = Элементы.НоменклатураПродаваемаяСовместноСДанной.ТекущиеДанные;
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//УжеЕстьЗаписьВРегистре = ПроверитьСуществующуюНоменклатуруСервер(ТекущиеДанные.НоменклатураСледствие, ТекущиеДанные.ХарактеристикаСледствие, ТекущиеДанные.ХарактеристикаПредпосылка);
	//		
КонецПроцедуры

&НаСервере
Функция ПроверитьСуществующуюНоменклатуруСервер(НомерСтроки, Номенклатура, Характеристика, ХарактеристикаПредпосылка)
	
	УжеЕстьЗапись = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НоменклатураСледствие", Номенклатура);
	Отбор.Вставить("ХарактеристикаСледствие", Характеристика);
	Отбор.Вставить("ХарактеристикаПредпосылка", ХарактеристикаПредпосылка);
	
	НайденныеСтроки = НоменклатураПродаваемаяСовместноСДанной.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = "В таблице уже есть строка для полей Строка " + НомерСтроки + ", " + ОтборНоменклатура 
			+ ?(ЗначениеЗаполнено(ХарактеристикаПредпосылка), " (" + ХарактеристикаПредпосылка + ")", "") 
			+ " - " + Номенклатура + " " + Характеристика;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		УжеЕстьЗапись = Истина;
	КонецЕсли;                               
	
	Если НЕ УжеЕстьЗапись Тогда
		МенеджерЗаписи = РегистрыСведений.НоменклатураПродаваемаяСовместно.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВариантАнализа 				= ВариантАнализа;
		//++ смарт:ММ #103 495 18.04.2021 
		Если Режим = 1 Тогда
		//-- смарт:ММ 18.04.2021
		МенеджерЗаписи.НоменклатураПредпосылка 		= ОтборНоменклатура;
		МенеджерЗаписи.ХарактеристикаПредпосылка 	= ХарактеристикаПредпосылка;
		МенеджерЗаписи.НоменклатураСледствие 		= Номенклатура;
		МенеджерЗаписи.ХарактеристикаСледствие 		= Характеристика;
		
		//++ смарт:ММ #103 495 18.04.2021 
		Иначе
			МенеджерЗаписи.НоменклатураПредпосылка 		= Номенклатура;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Характеристика;
			МенеджерЗаписи.НоменклатураСледствие 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаСледствие 		= ХарактеристикаПредпосылка;
		КонецЕсли;
		//-- смарт:ММ 18.04.2021
		
		//МенеджерЗаписи.ДобавленоАвтоматически 		= Ложь;
		
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ТекстСообщения = "В регистре уже имеется запись для полей Строка " + НомерСтроки + ", " + ВариантАнализа + ": " + ОтборНоменклатура 
			+ ?(ЗначениеЗаполнено(ХарактеристикаПредпосылка), " (" + ХарактеристикаПредпосылка + ")", "") 
			+ " - " + Номенклатура + " " + Характеристика;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			УжеЕстьЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Возврат УжеЕстьЗапись;
	
КонецФункции

&НаСервере
Процедура ПроставитьНомераСтрок()
	
	НомерСтроки = 1;
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры()
	
	Запрос = Новый Запрос;
	//++ смарт:ММ #103 495 04.05.2021 
	Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
	
	Если Режим = 1 Тогда 
	//-- смарт:ММ 04.05.2021
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураСледствие
	|ИЗ
	|	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
	|ГДЕ
	//++ смарт:ММ #103 495 04.05.2021 
	|	НоменклатураПродаваемаяСовместно.ВариантАнализа = &ВариантАнализа
	|	И
	//-- смарт:ММ 04.05.2021
	|	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка = &НоменклатураПредпосылка";
	
	Запрос.УстановитьПараметр("НоменклатураПредпосылка", ОтборНоменклатура);
	
	МассивУжеИспользованнойНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураСледствие");
	
	//++ смарт:ММ #103 495 04.05.2021 
	ИначеЕсли Режим = 2 Тогда 
	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|ГДЕ
		|	НоменклатураПродаваемаяСовместно.ВариантАнализа = &ВариантАнализа
		|	И
		|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие = &ОтборНоменклатура";
		
		Запрос.УстановитьПараметр("ОтборНоменклатура", ОтборНоменклатура);
		
		МассивУжеИспользованнойНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;	
	//-- смарт:ММ 04.05.2021
		
	// Дополнить номенклатурой из текущей табличной части
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		Если МассивУжеИспользованнойНоменклатуры.Найти(Строка.НоменклатураСледствие) = Неопределено Тогда
			МассивУжеИспользованнойНоменклатуры.Добавить(Строка.НоменклатураСледствие);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивУжеИспользованнойНоменклатуры;
		
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	Сч = 1;
	ИДСтроки = 0;
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл	
		Если Сч = 1 И НоменклатураПродаваемаяСовместноСДанной.Количество() <> 0 Тогда
			ИДСтроки = ПолучитьСледующийНомерСтроки();
		Иначе
			ИДСтроки = ИДСтроки + 1;
		КонецЕсли;
		
		ТекущаяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
		ТекущаяСтрока.НоменклатураСледствие = СтрокаТовара.Номенклатура;		
		ТекущаяСтрока.НомерСтроки = ИДСтроки;	
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомерСтроки()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПродаваемаяСовместноСДанной.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК НоменклатураПродаваемаяСовместноСДанной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВТ.НомерСтроки), 0) КАК НомерСтроки
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТЗ", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

//++ смарт:ММ #103 495 04.05.2021 
&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(ВариантАнализа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать вариант анализа");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры //-- смарт:ММ 04.05.2021

//++ смарт:ММ #103 495 04.05.2021 
&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивНедоступнойНоменклатуры = ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры();
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Истина, Ложь, Истина);
	ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элемент);
	
	Если МассивНедоступнойНоменклатуры.Количество() > 0 Тогда
		
		Элемент = ФормаПодбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		Элемент.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеВСписке;
		Элемент.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.Использование 		= Истина;
		Элемент.ПравоеЗначение 		= МассивНедоступнойНоменклатуры;
		
		Элемент.ИдентификаторПользовательскойНастройки = "ОтборСсылка";
		
	КонецЕсли;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры //-- смарт:ММ 04.05.2021

#КонецОбласти
